*** src/models/character/stats.rs:37:9: replace Character::record_generation with ()

*** mutation diff:
--- src/models/character/stats.rs
+++ replace Character::record_generation with ()
@@ -29,18 +29,17 @@
         self.conversations_had = self.conversations_had.saturating_add(1);
         let count = self.conversations_had_with_user.entry(user).or_default();
         *count = count.saturating_add(1);
         self.latest_conversation = Some(Zoned::now());
     }
 
     /// Records the words and tokens this character generated in a single reply.
     pub const fn record_generation(&mut self, words: u32, tokens: u32) {
-        self.words_generated = self.words_generated.saturating_add(words);
-        self.tokens_generated = self.tokens_generated.saturating_add(tokens);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a formatted string of conversation counts, grouped by user.
     #[must_use]
     pub async fn formatted_conversations_had(&self, db: &Database) -> String {
         let mut string = format!("Totalt: {}", self.conversations_had);
         // a BTreeMap already iterates in sorted key order, so no separate sort is needed
         for (id, count) in &self.conversations_had_with_user {

---- database::tests::record_character_generation_lands_on_the_latest_version stdout ----

thread 'database::tests::record_character_generation_lands_on_the_latest_version' (507214) panicked at src/database.rs:1031:9:
generation stats land on the latest version

failures:
    database::tests::record_character_generation_lands_on_the_latest_version

test result: FAILED. 106 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
