*** src/models/character/stats.rs:44:9: replace Character::formatted_conversations_had -> String with "xyzzy".into()

*** mutation diff:
--- src/models/character/stats.rs
+++ replace Character::formatted_conversations_had -> String with "xyzzy".into()
@@ -36,25 +36,17 @@
     pub const fn record_generation(&mut self, words: u32, tokens: u32) {
         self.words_generated = self.words_generated.saturating_add(words);
         self.tokens_generated = self.tokens_generated.saturating_add(tokens);
     }
 
     /// Returns a formatted string of conversation counts, grouped by user.
     #[must_use]
     pub async fn formatted_conversations_had(&self, db: &Database) -> String {
-        let mut string = format!("Totalt: {}", self.conversations_had);
-        // a BTreeMap already iterates in sorted key order, so no separate sort is needed
-        for (id, count) in &self.conversations_had_with_user {
-            let name = db.substitute_name(id).await;
-            if let Err(why) = write!(string, "\nMed {name}: {count}") {
-                warn!("error while writing to string: {why}");
-            }
-        }
-        string
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the character's last-used time, compactly formatted, or `aldrig`
     /// when the character has never been spawned into a conversation.
     #[must_use]
     pub fn formatted_latest_conversation(&self) -> String {
         self.latest_conversation.as_ref().map_or_else(
             || "aldrig".to_owned(),

*** result: Success
