*** src/models/character/stats.rs:59:9: replace Character::formatted_latest_conversation -> String with String::new()

*** mutation diff:
--- src/models/character/stats.rs
+++ replace Character::formatted_latest_conversation -> String with String::new()
@@ -51,14 +51,11 @@
         }
         string
     }
 
     /// Returns the character's last-used time, compactly formatted, or `aldrig`
     /// when the character has never been spawned into a conversation.
     #[must_use]
     pub fn formatted_latest_conversation(&self) -> String {
-        self.latest_conversation.as_ref().map_or_else(
-            || "aldrig".to_owned(),
-            |time| time.strftime(LATEST_CONVERSATION_FORMAT).to_string(),
-        )
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }

---- commands::stats::tests::a_single_character_is_ranked_with_its_stat_columns stdout ----

thread 'commands::stats::tests::a_single_character_is_ranked_with_its_stat_columns' (509295) panicked at src/commands/stats.rs:106:9:
assertion `left == right` failed
  left: "1. 🎭 Harry: 42 konversationer, 1.2k ord, 3.4k tokens, senast använd: "
 right: "1. 🎭 Harry: 42 konversationer, 1.2k ord, 3.4k tokens, senast använd: aldrig"

---- commands::stats::tests::the_last_used_time_is_shown_when_present stdout ----

thread 'commands::stats::tests::the_last_used_time_is_shown_when_present' (509301) panicked at src/commands/stats.rs:128:9:
assertion `left == right` failed
  left: "1. 🎭 Harry: 42 konversationer, 0 ord, 0 tokens, senast använd: "
 right: "1. 🎭 Harry: 42 konversationer, 0 ord, 0 tokens, senast använd: 2026-06-22 19:33"

failures:
    commands::stats::tests::a_single_character_is_ranked_with_its_stat_columns
    commands::stats::tests::the_last_used_time_is_shown_when_present

test result: FAILED. 105 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
